# Introduction to handle timeseries data with pandas

In [1]:
import pandas as pd
import numpy as np

In [19]:
data = ['05/30/2019 10:00:00 PM', '04/30/2019 11:00:00 PM', '04/30/2019 11:00:00 PM', '04/30/2019 09:00:00 PM']

In [20]:
time_data = pd.DataFrame(data, columns=['Date'])
time_data

                     Date
0  05/30/2019 10:00:00 PM
1  04/30/2019 11:00:00 PM
2  04/30/2019 11:00:00 PM
3  04/30/2019 09:00:00 PM

In [21]:
time_data.dtypes

Date    object
dtype: object

In [22]:
time_data['Date'] = pd.to_datetime(time_data['Date'])
time_data

                 Date
0 2019-05-30 22:00:00
1 2019-04-30 23:00:00
2 2019-04-30 23:00:00
3 2019-04-30 21:00:00

In [23]:
time_data.dtypes

Date    datetime64[ns]
dtype: object

In [24]:
# Extracting 'year' column seperately
time_data['year'] = time_data['Date'].dt.year
time_data

                 Date  year
0 2019-05-30 22:00:00  2019
1 2019-04-30 23:00:00  2019
2 2019-04-30 23:00:00  2019
3 2019-04-30 21:00:00  2019

In [25]:
# Extracting 'month' column seperately
time_data['month'] = time_data['Date'].dt.month
time_data

                 Date  year  month
0 2019-05-30 22:00:00  2019      5
1 2019-04-30 23:00:00  2019      4
2 2019-04-30 23:00:00  2019      4
3 2019-04-30 21:00:00  2019      4

In [26]:
# Extracting 'day' column seperately
time_data['day'] = time_data['Date'].dt.day
time_data

                 Date  year  month  day
0 2019-05-30 22:00:00  2019      5   30
1 2019-04-30 23:00:00  2019      4   30
2 2019-04-30 23:00:00  2019      4   30
3 2019-04-30 21:00:00  2019      4   30

In [27]:
# Extracting 'week' column seperately
time_data['Week'] = time_data['Date'].dt.week
time_data

/Users/chiraggarg/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.

                 Date  year  month  day  Week
0 2019-05-30 22:00:00  2019      5   30    22
1 2019-04-30 23:00:00  2019      4   30    18
2 2019-04-30 23:00:00  2019      4   30    18
3 2019-04-30 21:00:00  2019      4   30    18

In [28]:
monthly_average = time_data.groupby(['month'])['day'].agg(np.mean)
monthly_average

month
4    30
5    30
Name: day, dtype: int64